# -Задача по итогам блока: Написать программу, которая из имеющегося массива строк, формирует массив из строк, длина которых <= 3 символа
 
СОЗДАНИЕ МАССИВА СТРОК:
string[ ] ArrText ={текст};
 
Если длина элемента <= 3, то он попадает в выборку.

var result = ArrText.Where(p => p.Length <= 3); // C использованием переменной без какого-либо типа данных, для выбора элементов из массива используем метод "Where" 

Циклично проверив все значения текстового массива, выведем только те, длина которых <=3 
foreach (string text in result)

Вывод значений
Console.Write($" {text}");
